docs: updated architecture.md
